20231027T141432--kdoc-50-『unity-performance-tuning-bible』__book.org
:properties:
:ID: 20231027T141432
:end:
#+title:      KDOC 50: 『Unity Performance Tuning Bible』
#+date:       [2023-10-27 Fri 14:14]
#+filetags:   :book:
#+identifier: 20231027T141432

『Unity Performance Tuning Bible』はサイバーエージェント社が公開している本である。[[https://github.com/CyberAgentGameEntertainment/UnityPerformanceTuningBible][CyberAgentGameEntertainment/UnityPerformanceTuningBible]]で配布されている。前半は基本的なUnityの説明になっていて、初心者でも参考になる。

メモ。

- Unityは、[[id:ccab3205-73b6-4009-9ec8-4e08eb1d2003][C#]]のコードを中間言語にコンパイルし、その中間言語を.NET Frameworkのランタイムを用いて機械語にしている
  - それぞれの環境向けのランタイムで実行することで、マルチプラットフォームを実現している
- 中間言語は、メモリ確保や実行速度などのパフォーマンスを意識するうえで非常に重要である
  - C#から中間言語への対応関係を把握しておくとよい
  - そのために変換結果を確認しておくのがおすすめ
