20231027T141432--kdoc-50-『unity-performance-tuning-bible』__book.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-11-27T23:12:00Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 50: 『Unity Performance Tuning Bible』</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 50: 『Unity Performance Tuning Bible』</h1>
<p>
『Unity Performance Tuning Bible』はサイバーエージェント社が公開している本である。<a href="https://github.com/CyberAgentGameEntertainment/UnityPerformanceTuningBible">CyberAgentGameEntertainment/UnityPerformanceTuningBible</a>で配布されている。前半は基本的なUnityの説明になっていて、初心者でも参考になる。
</p>

<p>
メモ。
</p>

<ul class="org-ul">
<li>Unityは、<a href="20240213004323-c.html#ID-ccab3205-73b6-4009-9ec8-4e08eb1d2003">C#</a>のコードを中間言語にコンパイルし、その中間言語を.NET Frameworkのランタイムを用いて機械語にしている
<ul class="org-ul">
<li>それぞれの環境向けのランタイムで実行することで、マルチプラットフォームを実現している</li>
</ul></li>
<li>中間言語は、メモリ確保や実行速度などのパフォーマンスを意識するうえで非常に重要である
<ul class="org-ul">
<li>C#から中間言語への対応関係を把握しておくとよい</li>
<li>そのために変換結果を確認しておくのがおすすめ</li>
</ul></li>
</ul>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
